Repository: adibendahan/SimplyFilterSMS-iOS
Catalog: Simply Filter SMS/Resources/*.lproj/Localizable.strings
Languages: he, ru

# general_allow
source: Allow
he: אפשר
ru: Разрешить

# general_deny
source: Deny
he: חסום
ru: Запретить

# general_null
source: (null)
he: (ריק)
ru: (Пусто)

# general_copyright
source: © %ld Adi Ben-Dahan. All rights reserved.
he: © %ld עדי בן-דהן, כל הזכויות שמורות.
ru: © %ld Ади Бен-Дахан. Все права защищены.

# general_close
source: Close
he: סגירה
ru: Закрыть

# lang_supported
source: Supported Languages
he: שפות נתמכות
ru: Поддерживаемые языки

# lang_allBlocked
source: You've blocked all supported languages!
he: כל השפות הנתמכות כבר חסומות!
ru: Вы заблокировали все поддерживаемые языки!

# lang_how
source: Language processing and identification is done **locally** by the Natural Language engine of iOS. A message will be filtered only if the **dominant language** of the text is on the 'Blocked Languages' list.
he: עיבוד וזיהוי השפה נעשה **לוקאלית** ע״י מנוע השפות של מערכת ההפעלה. הודעה תחסם רק אם **השפה הדומיננטית** של הטקסט נמצאת ברשימת השפות החסומות.
ru: Обработка и идентификация языка производится **локально** iOS движком NaturalLanguage. Сообщение будет отфильтровано только если **преобладающий язык** текста находится в списке заблокированных языков.

# filterList_filters
source: Filters
he: פילטרים
ru: Фильтры

# filterList_allowed
source: Allowed Texts
he: טקסטים מאופשרים
ru: Разрешённые тексты

# filterList_denied
source: Blocked Texts
he: טקסטים חסומים
ru: Запрещённые тексты

# filterList_menu_filterLanguage
source: Block a Language
he: חסימת שפה
ru: Блокировать язык

# filterList_menu_enableExtension
source: Help
he: עזרה
ru: Помощь

# filterList_menu_about
source: About
he: אודות
ru: О приложении

# filterList_menu_debug
source: Load Debug Data
he: טעינת נתוני דיבאג
ru: Загрузить данные дебага

# filterList_deniedLanguage
source: Blocked Languages
he: שפות חסומות
ru: Заблокированные языки

# filterList_deleteFiltersCount
source: Delete (%ld)
he: מחיקה (%ld)
ru: Удалить (%ld)

# filterList_folder
source: Folder
he: תיקייה
ru: Папка

# addFilter_add
source: Add
he: הוספה
ru: Добавить

# addFilter_text
source: Type a word (at least 3 characters)
he: הקלידו מילה
ru: Введите слово

# addFilter_type
source: Type
he: סוג פילטר
ru: Тип

# addFilter_type_caption
source: Select an action:
he: בחרו פעולה
ru: Выберите действие:

# addFilter_folder_caption
source: Select a destination folder:
he: בחרו תיקיית יעד (לחצו כדי לשנות):
ru: Выберите папку:

# addFilter_folder_junk
source: Junk
he: זבל
ru: Спам

# addFilter_folder_transactions
source: Transactions
he: עסקאות
ru: Транзакции

# addFilter_folder_promotions
source: Promotions
he: קידומי מכירות
ru: Реклама

# addFilter_duplicate
source: Duplicate Filter
he: פילטר קיים
ru: Существующий фильтр

# enableExtension_step1
source: Step 1
he: שלב 1
ru: Шаг 1

# enableExtension_step1_desc
source: Open 'Settings' App and tap on 'Messages'
he: פתחו את 'הגדרות' ולחצו על 'הודעות'
ru: Откройте приложение 'Настройки' и нажмите на 'Сообщения'

# enableExtension_step2
source: Step 2
he: שלב 2
ru: Шаг 2

# enableExtension_step2_desc
source: Tap on 'Unknown & Spam' under 'Message Filtering'
he: לחצו על 'לא ידוע וספאם' תחת 'סינון הודעות'
ru: Нажмите на 'Неизвестные и спам' под 'Фильтры сообщений'

# enableExtension_step3
source: Step 3
he: שלב 3
ru: Шаг 3

# enableExtension_step3_desc
source: Turn on 'Simply Filter SMS' under 'SMS Filtering'
he: הפעילו את 'Simply Filter SMS' תחת 'סינון הודעות טקסט'
ru: Включите 'Simply Filter SMS' под 'Фильтрация SMS'

# enableExtension_welcome
source: Welcome! 🥳
he: ברוכים הבאים! 🥳
ru: Добро пожаловать! 🥳

# enableExtension_welcome_desc
source: You need to enable Simply Filter SMS as your SMS filter app in iOS Settings.
he: יש לאפשר את Simply Filter SMS כאפליקציה שמסננת הודעות בהגדרות של מערכת ההפעלה.
ru: Вам нужно включить Simply Filter SMS для фильтрации ваших сообщений в iOS-приложении Настройки.

# enableExtension_welcome_callToAction
source: Show me how
he: הראה לי איך
ru: Показать как

# enableExtension_welcome_cancel
source: It's done
he: כבר עשיתי זאת
ru: Пропустить

# enableExtension_ready
source: Ready?
he: מוכנים?
ru: Готовы?

# enableExtension_ready_desc
source: Tap on the ***%@*** button to go to iOS Settings app or ***%@*** if you already enabled 'Simply Filter SMS' as your SMS filter app.
he: לחצו על כפתור ה***%@*** על מנת לעבור להגדרות מערכת ההפעלה או ***%@*** אם כבר הגדרתם את 'Simply Filter SMS' כאפליקציה שמסננת הודעות.
ru: Нажмите на кнопку ***%@***, чтобы открыть iOS-приложение Настройки или ***%@***, если вы уже включили 'Simply Filter SMS' для фильтрации ваших сообщений.

# enableExtension_ready_callToAction
source: Settings
he: הגדרות
ru: Настройки

# enableExtension_ready_cancel
source: Cancel
he: ביטול
ru: Пропустить

# enableExtension_next
source: Next step
he: שלב הבא
ru: Далее

# aboutView_aboutSection
source: About
he: אודות
ru: О приложении

# aboutView_linksSection
source: Links
he: קישורים
ru: Ссылки

# aboutView_aboutText
source: Developed by Adi Ben-Dahan in Tel Aviv, Israel 🇮🇱 All message filtering is done locally with no data collection whatsoever. If you encounter a problem with the app functionality please open an issue on the GitHub project page.
he: פותח על ידי עדי בן-דהן בתל אביב, ישראל 🇮🇱 סינון ההודעות נעשה לוקאלית בלבד, לא נאסף שום מידע. אם נתקלת בבעיה בתפעול האפליקציה בבקשה דווח בדף הפרוייקט ב-GitHub.
ru: Разработал Ади Бен-Дахан в Тель-Авиве, Израилe 🇮🇱 Вся фильтрация сообщений производится локально без сбора каких-либо данных. Если у вас возникнет проблема в работе приложения, пожалуйста, сообщите о ней на странице проекта в GitHub.

# aboutView_sendMail
source: Email
he: אימייל
ru: Электронная почта

# aboutView_appIconCredit
source: Vitali Levit
he: ויטאלי לויט
ru: 🙏🏼 Отдельная благодарность дизайнеру иконки: [Виталий Левит](https://instagram.com/eighteeneleven_by_rkl).

# faq_subtitle
source: Here's a list of frequently asked questions, if you can't find your answer here you can reach out by
he: הנה רשימה של שאלות שכיחות, אם אתם לא מוצאים את התשובה לשאלתכם צרו קשר בעזרת
ru: Список часто задаваемых вопросов. Если вы не нашли ответ на ваш вопрос, вы можете связаться через

# faq_question_0
source: How do I activate message filtering in iOS?
he: איך מפעילים את הסינון במערכת ההפעלה?
ru: Как включить фильтрацию сообщений в iOS?

# faq_answer_0
source: Tap to open the onboarding screen.
he: לחצו כאן כדי לעבור להסבר על הפעלת הסינון.
ru: Нажмите для перехода на экран обучения

# faq_question_1
source: How does message filtering work?
he: איך עובד הסינון של ההודעות?
ru: Как работает фильтрация сообщений?

# faq_answer_1
source: When you recive a text message from a number that is not in your contact list, Simply Filter SMS will filter it based on the following rules: • If a text message contains text matching to a filter from the 'Allowed Texts' it will be delivered regularly. • If not, the message will be scanned for matching filters from the 'Blocked Texts' and in case any were found it will be delivered to the Junk folder. • If the text doesn't contain any text that matches the filters, it will be delivered regularly.
he: כאשר אתם מקבלים הודעת טקסט ממספר שלא נמצא באנשי הקשר שלכם, Simply Filter SMS תסנן את ההודעה בעזרת החוקים הבאים: • אם ההודעה מכילה מילה מרשימת המילים המאופשרות היא תתקבל כהודעה רגילה. • אם לא, ההודעה תיסרק על מנת למצוא מילים מרשימת המילים החסומות ובמקרה שנמצאה מילה חסומה ההודעה תעבור לתיקיית הזבל. • אם ההודעה לא מכילה מילים חסומות, היא תתקבל כהודעה רגילה.
ru: Когда вы получаете текстовое сообщение с номера, которого нет в списке ваших контактов, Simply Filter SMS отфильтрует его, основываясь на следующих правилах: • Если текстовое сообщение содержит любое слово из списка разрешённых, сообщение будет доставлено как обычно. • В противном случае сообщение будет просканировано на наличие запрещённых слов, и при их обнаружении сообщение будет помещено в папку Спам. • Если сообщение не содержит никаких запрещённых слов, оно будет доставлено как обычно.

# faq_question_2
source: Are my messages exposed to the app developer?
he: האם ההודעות שלי חשופות למפתח האפליקציה?
ru: Доступны ли мои сообщения разработчику приложения?

# faq_answer_2
source: No. Simply Filter SMS does not collect any information whatsoever, all message processing is done locally on your device without any logging.
he: לא. Simply Filter SMS לא אוספת שום מידע על המשתמש, סריקת ההודעות נעשית באופן לוקאלי בלבד על המכשיר מבלי לכתוב כל לוג.
ru: Нет. Simply Filter SMS не собирает никакой информации, вся обработка сообщений производится локально на вашем устройстве без логирования.

# faq_question_3
source: What about iMessages and messages from my contacts?
he: מה לגבי iMessages והודעות מאנשי הקשר שלי?
ru: Что насчёт iMessages и сообщений от моих контактов?

# faq_answer_3
source: Apple does not expose those messages to any developer, they remain completely private.
he: אפל לא חושפת את תוכן ההודעות האלה למפתחים, הן נשארות פרטיות לחלוטין.
ru: Apple не предоставляет эти сообщения разработчикам, они остаются полностью приватными.

# faq_question_4
source: Where are the filtered messages?
he: איפה ההודעות שנחסמו?
ru: Где находятся отфильтрованные сообщения?

# faq_answer_4
source: When a text message is tagged as junk it will still be available for reading on the Messages app under the Junk folder.
he: כאשר הודעה מסומנת כזבל ניתן עדיין לקרוא אותה בתיקיית הזבל באפליקציית ההודעות במערכת ההפעלה.
ru: Когда текстовое сообщение помечено как спам, оно всё ещё доступно для прочтения в приложении Сообщения в папке Спам.

# faq_question_5
source: What's the difference between Junk/Transactions/Promotions folders?
he: מה ההבדל בין תיקיית זבל/פעולות/פרסומי?
ru: Какая разница между папками Спам/Транзакции/Реклама?

# faq_answer_5
source: Not much, you can filter any word to any folder. Those folders are not customizable in any way. Only messages filtered to the Junk folder will be delivered silently.
he: אין הבדל רב, ניתן לסנן כל מילה לכל תיקייה. התיקיות הינן קבועות ואינן ניתנות לשינוי. רק הודעות שמסוננות לתיקיית זבל יתקבלו ללא כל התראה.
ru: Незначительная. Вы можете поместить любое слово в любую папку. Эти папки нельзя изменить. Только сообщения, которые направляются в папку Спам, будут доставлены без уведомления.

# autoFilter_title
source: Automatic Filtering
he: סינון אוטומטי
ru: Автоматическая фильтрация

# autoFilter_lastUpdated
source: Updated on %@
he: עודכן לארונה ב %@
ru: Обновлено %@

# autoFilter_forceUpdate
source: Force Update
he: עדכן עכשיו
ru: Обновить сейчас

# autoFilter_neverUpdated
source: Never
he: לעולם לא
ru: Никогда

# autoFilter_ON
source: ON
he: פועל
ru: Вкл.

# autoFilter_OFF
source: OFF
he: כבוי
ru: Выкл.

# autoFilter_allUnknown
source: Block All Unknown
he: אפשר הודעות מאנשי קשר בלבד
ru: Блокировать неизвестных отправителей

# autoFilter_links
source: Block Links
he: חסום קישורים
ru: Блокировать ссылки

# autoFilter_numbersOnly
source: Allow Numbers Only
he: אפשר מספרים בלבד
ru: Разрешить только цифры

# autoFilter_shortSender
source: Block Short Senders
he: חסום שולחים קצרים
ru: Блокировать коротких отправителей

# autoFilter_shortSender_desc
source: At least %ld characters
he: לפחות %ld תווים
ru: Минимум %ld символов

# autoFilter_shortSender_change
source: Tap to change
he: לחצו בכדי לשנות
ru: Нажмите, чтобы изменить

# autoFilter_shortSender_action
source: Select new limit
he: בחרו הגבלה חדשה
ru: Выберите новый лимит

# autoFilter_allUnknown_shortTitle
source: All unknwon senders (except Allowed Text)
he: אנשי קשר בלבד (למעט טקסט מאופשר)
ru: Все неизвестные отправители (кроме Разрешённых текстов)

# autoFilter_links_shortTitle
source: Links
he: קישורים
ru: Ссылки

# autoFilter_numbersOnly_shortTitle
source: Numbers only
he: מספרים בלבד
ru: Только цифры

# autoFilter_shortSender_shortTitle
source: Short senders
he: שולחים קצרים
ru: Короткие отправители

# general_active_count
source: %ld active
he: %ld פילטרים
ru: Активных %ld

# filterList_text
source: Text
he: טקסט
ru: Текст

# addFilter_addLanguage
source: Add Language
he: הוספת שפה
ru: Добавить язык

# autoFilter_smartFilters
source: Smart filters
he: פילטרים חכמים
ru: Умные фильтры

# autoFilter_yourFilters
source: Your filters
he: הפילטרים שלך
ru: Ваши фильтры

# autoFilter_email
source: Block Email Senders
he: חסום הודעות דואר אלקטרוני
ru: Блокировать электронные письма

# autoFilter_email_shortTitle
source: Email
he: דואר אלקטרוני
ru: Электронная почта

# testFilters_title
source: Test Your Filters
he: בחנו את הפילטרים שלכם
ru: Проверьте свои фильтры

# testFilters_messageTitle
source: Message
he: הודעה
ru: Сообщение

# testFilters_senderTitle
source: Sender (optional)
he: שולח (אופציונאלי)
ru: Отправитель (необязательно)

# testFilters_resultAllowed
source: It's Allowed! 🥳
he: זו הודעה תקינה! 🥳
ru: Сообщение разрешено! 🥳

# testFilters_resultJunk
source: It's Junk! 😈
he: זו הודעת זבל! 😈
ru: Спам! 😈

# testFilters_resultPromotion
source: It's a Promotion! 📢
he: זו הודעה פרסומית! 📢
ru: Это реклама! 📢

# testFilters_resultTransaction
source: It's a Transaction! 🧾
he: זו הודעה על פעולה! 🧾
ru: Это транзакция! 🧾

# testFilters_action
source: Test
he: לחצו לבדיקה
ru: Проверить

# help_automaticFiltering_question
source: How does Automatic Filtering work?
he: איך עובד הסינון האוטומטי של ההודעות?
ru: Как работает автоматическая фильтрация?

# help_automaticFiltering
source: Automatic Filtering is using a pre defined list of terms to determine if a message should be sent to the Junk folder or not. The lists are updated periodically with new terms. Your regular filters are still considered when Automatic Filtering is on.
he: סינון אוטומטי משתמש ברשימה מוכנה של מילים על מנת לקבוע האם הודעה היא זבל או לא. הרשימה מתעדכנת עם מילים חדשות לעיתים. הפילטרים האחרים שלך עדיין פעילים גם כאשר סינון אוטומטי מופעל.
ru: Автоматическая фильтрация использует предварительно определённый список терминов, чтобы определить, должно ли сообщение быть отправлено в папку Спам или нет. Списки периодически дополняются новыми терминами. Ваши обычные фильтры по-прежнему учитываются, когда включена автоматическая фильтрация.

# help_deny
source: Add texts that will cause a message to be marked as spam, you can also choose the specific folder you want the message to be stored in.
he: הוסיפו טקסטים שיגרמו להודעה להיחשב כזבל, אתם יכולים גם לבחור את התיקייה אליה ההודעה תסונן.
ru: Добавьте текст, который заставит сообщение быть помеченным как Спам, вы также можете выбрать конкретную папку, в которую вы хотите поместить сообщение.

# help_allow
source: Add texts that will cause a message to be marked as valid. It is recommended to add uniqe identifying texts like your name here. Text appear on this list have the highest priority when filtering a message.
he: הוסיפו טקסטים שיגרמו להודעה להיחשב כהודעה רגילה. מומלץ להוסיף טקסטים יחודיים שמאפיינים אתכם כגון שם פרטי ושם משפחה. טקסטים שמופיעים ברשימה הזאת מקבלים את התיעדוף הכי גבוה כאשר הודעה מסוננת.
ru: Добавьте текст, который заставит сообщение быть помеченным как разрешённое. Здесь рекомендуется добавлять уникальные идентифицирующие тексты, такие как ваше имя. Текст из этого списка имеет наивысший приоритет при фильтрации сообщений.

# addFilter_addFilter_allow
source: Add Allowed Text
he: הוספת טקסט מאופשר

# addFilter_addFilter_deny
source: Add Blocked Text
he: הוספת טקסט חסום

# addFilter_target_all
source: Sender + Body
he: שולח + הודעה

# addFilter_target_sender
source: Sender
he: שולח

# addFilter_target_body
source: Body
he: הודעה

# addFilter_more
source: See more options
he: הראה אפשרויות נוספות

# addFilter_less
source: See less
he: הראה פחות

# addFilter_target_title
source: Select a target:
he: בחרו חלק בהודעה:

# addFilter_case_title
source: Select case sensitivity:
he: בחרו האם להתחשב באותיות רישיות:

# addFilter_case_sensitive
source: Case Sensitive
he: להתחשב

# addFilter_case_insensitive
source: Case Insensitive
he: לא להתחשב

# addFilter_match_title
source: Select matching type:
he: בחרו סוג השוואה:

# addFilter_match_exact
source: Exact
he: מדויק

# addFilter_match_contains
source: Contains
he: מכיל

# filterList_options
source: Options
he: אפשרויות

# addFilter_target_all_multiline
source: Sender + Body
he: שולח + הודעה

# general_lang
source: Language
he: שפה

# notification_offline_title
source: iCloud sync is paused
he: הסנכרון ל-iCloud מושהה

# notification_offline_subtitle
source: Your device has no network
he: המכשיר אינו מחובר לרשת

# notification_sync_title
source: iCloud sync is on
he: הסנכרון ל-iCloud פועל

# notification_sync_subtitle
source: Local device data was updated
he: המידע על המכשיר עודכן בהצלחה

# notification_hide
source: Hide
he: הסתר

# notification_automatic_title
source: Automatic Filtering
he: סינון אוטומטי

# notification_automatic_subtitle
source: Filters were updated
he: עודכנו פילטרים חדשים

# autoFilter_empty
source: Go online while the app is open at least once to download the Automatic Filtering lists.
he: הפעילו את האפליקציה כאשר אתם אונליין לפחות פעם אחת על מנת לעדכן את רשימת הפילטרים האוטומטים

# aboutView_review
source: Rate us please!
he: דרגו אותנו בבקשה!

# autoFilter_error
source: It seems there is a problem downloading the Automatic Filtering lists. Please try again later.
he: נראה שיש בעיה בהורדת רשימת הפילטרים האוטומטים. אנא נסו שוב במועד מאוחר יותר.

# testFilters_resultReason_noMatch
source: No match
he: לא נמצאה התאמה

# testFilters_resultReason_unknownSender
source: Unknown sender
he: שולח לא מוכר

# testFilters_resultReason
source: Reason:
he: סיבה:

# autoFilter_emojis
source: Block Emojis
he: חסום אימוג'ים

# autoFilter_emojis_shortTitle
source: Emojis
he: אימוג'ים

# aboutView_appIconCreditTitle
source: Icon Designer
he: מעצב האייקון

# notification_clipboard_subtitle
source: Copied to clipboard
he: הועתק ללוח

# aboutView_twitter
source: a_bd
ru: Twitter
